// Misc Strings

"fibre-channel-card-name"           = "Apple FC -kortti";
"unknown"                           = "<tuntematon>";
"default-filename"                  = "Fibre Channel -kortit";
"port-name-prefix"                  = "Portti ";
"slot-name-prefix"					= "Paikka ";
"restart-required"                  = "Asetukset tulevat voimaan uudelleenkäynnistyksen jälkeen";

// Status string.

"Offline"                           = "Portin linkki ei toimi.";
"Online"                            = "Portin linkki toimii.";
// Speed status string.
"speed-status"                      = " Nopeus on <<replace>>.";	// Note that the "<<replace>>" in this string
                                                                            // is replaced by one of the speed status strings below.
                                                                            // This is to allow for different placements within the
                                                                            // sentance of the status string.

"link-status-nolink"				= "Linkkiä ei ole muodostettu";
"link-status-nolink-unsupported"	= "Linkkiä ei muodostettu (kaapelia ei tueta)";
"link-status-link"					= "Linkki muodostettu";
"link-status-link-unsupported"		= "Linkki muodostettu (ei-tuettu kaapeli)";

// speed status string.
"1-gigabit-per-second"              = "1 Gb/s";
"2-gigabit-per-second"              = "2 Gb/s";
"speed-automatic"                   = "määrittele automaattisesti";
"automatic-1-gigabit"               = "määrittele automaattisesti ja on nyt 1 Gb/s";
"automatic-2-gigabit"               = "määrittele automaattisesti ja on nyt 2 Gb/s";

// Topology status string.
"toplogy-status"                    = " Portin topologia on <<replace>>.";	// Note that the "<<replace>>" in this string
                                                                                    // is replaced by one of the speed status strings below.
                                                                                    // This is to allow for different placements within the
                                                                                    // sentance of the status string.
// topology status string.
"point-to-point"                    = "Point-to-Point";
"arbitrated-loop"                   = "Arbitrated Loop";
"topology-automatic"                = "määrittele automaattisesti";
"automatic-point-to-point"          = "määrittele automaattisesti ja on nyt Point-to-Point";
"automatic-arbitrated-loop"         = "määrittele automaattisesti ja on nyt Arbitrated Loop";

// Alerts
"incompatible-driver-title"         = "Asenna uusin ohjain";
"incompatible-driver"               = "Tämä ohjelma vaatii AppleLSIFusionMPT.kext 1.1.0:n tai uudemman. Varmista, että olet asentanut uusimman ohjaimen ja yritä uudelleen.";
"alert-no-cards-title"              = "Applen Fibre Channel -korttia ei löytynyt";
"alert-no-cards"                    = "Varmista, että Applen Fibre Channel -kortti on asennettu oikein ja yritä uudelleen.";
"alert-restart-title"               = "Käynnistä uudelleen";
"alert-restart-required"            = "Jotta asetukset tulevat voimaan, tietokone on käynnistettävä uudelleen. Haluatko käynnistää tietokoneen uudelleen nyt?";
"alert-ok-button"                   = "OK";
"alert-yes-button"                  = "Kyllä";
"alert-no-button"                   = "Ei";
"alert-cancel-button"               = "Kumoa";
"alert-tool-title"                  = "fibreconfig-työkalun virhe";
"alert-fibreconfig-error"           = "fibreconfig-työkalua käytettäessä tapahtui virhe.";
"alert-missing-tool"                = "fibreconfig-työkalu puuttuu.";
"alert-non-executeable-tool"        = "fibreconfig-työkalua ei voida suorittaa ja se on ehkä asennettava uudelleen.";
"ww-node-name-tooltip"              = "Solmun maailmanlaajuinen nimi";
"ww-port-name-tooltip"              = "Portin maailmanlaajuinen nimi";